Библиотека_электронных_документов_демо/src/ExchangePlans/ОбменУправлениеТорговлей103КлиентЭДО/ОбменУправлениеТорговлей103КлиентЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="627e1963-9d03-4140-bfb3-601759699fcd">
  <name>ОбменУправлениеТорговлей103КлиентЭДО</name>
  <attributes>
    <name>ДатаНачалаВыгрузкиДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоУчастникамЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиДокументов</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиСправочников</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчастникиЭДО</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Библиотека_электронных_документов_демо/src/ExchangePlans/ОбменУправлениеТорговлей103КлиентЭДО/Forms/ФормаНастройкиУзла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСервер.ФормаНастройкиУзлаПриСозданииНаСервере(ЭтотОбъект,
		Метаданные.ПланыОбмена.ОбменУправлениеПредприятиемКлиентЭДО.Имя);
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПереключательОтправлятьНСИАвтоматическиПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательОтправлятьНСИПоНеобходимостиПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательОтправлятьНСИНикогдаПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательДокументыОтправлятьАвтоматическиПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательДокументыОтправлятьВручнуюПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательДокументыНеОтправлятьПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагИспользоватьОтборПоОрганизациямПриИзменении(Элемент)
	
	Элементы.УчастникиЭДО.Доступность = ИспользоватьОтборПоУчастникамЭДО;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Не ИспользоватьОтборПоУчастникамЭДО И УчастникиЭДО.Количество() <> 0 Тогда
		УчастникиЭДО.Очистить();
	ИначеЕсли УчастникиЭДО.Количество() = 0 И ИспользоватьОтборПоУчастникамЭДО Тогда
		ИспользоватьОтборПоУчастникамЭДО = Ложь;
	КонецЕсли;
	
	Если РежимВыгрузкиДокументов <> 
		Элементы.ПереключательДокументыОтправлятьАвтоматически.СписокВыбора[0].Значение Тогда
		ДатаНачалаВыгрузкиДокументов = Дата(1,1,1);
	КонецЕсли;
	
	// Сохранение настроек
	ОбменДаннымиКлиент.ФормаНастройкиУзлаКомандаЗакрытьФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьНаСервере()
	
	Если РежимВыгрузкиСправочников = 
			Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости
		И РежимВыгрузкиДокументов = 
			Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать Тогда
		
		РежимВыгрузкиДокументов = 
			Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
	КонецЕсли;
	
	Элементы.ДатаНачалаВыгрузкиДокументов.Доступность = РежимВыгрузкиДокументов = 
		Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
	
	Элементы.ГруппаНеСинхронизироватьДокументы.Доступность = РежимВыгрузкиСправочников = 
		Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
	
	Элементы.ГруппаРежимОтправкиДокументов.Доступность = РежимВыгрузкиСправочников <> 
		Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	
	Если РежимВыгрузкиСправочников = 
		Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать Тогда
		
		РежимВыгрузкиДокументов = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
		Элементы.ГруппаОтборПоУчастникамЭДО.Видимость = Ложь;
	Иначе
		Элементы.ГруппаОтборПоУчастникамЭДО.Видимость = Истина;
		Элементы.УчастникиЭДО.Доступность = ИспользоватьОтборПоУчастникамЭДО;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
